import math
from sympy import *
T=187.63408999999996 #среднее время наработки до отказа
D=10123.66686227602 #дисперсия несмещённая
Ya=(D/T**2)+1
print('Ya =', Ya )
a=1.94475
a1=1+1/a
a2=1+2/a
Q1=1+(1/12)*a1**(-1)+(1/288)*a1**(-2)-(139/51840)*a1**(-3)-(571/2488320)*a1**(-4)
print('Q1 =',Q1)
G1=exp(-a1)*a1**(a1-0.5)*((2*math.pi)**0.5)*Q1
print('G1 =',G1)
Q2=1+(1/12)*a2**(-1)+(1/288)*a2**(-2)-(139/51840)*a2**(-3)-(571/2488320)*a2**(-4)
print('Q2 =',Q2)
G2=exp(-a2)*a2**(a2-0.5)*((2*math.pi)**0.5)*Q2
print('G2 =',G2)
d=G2/(G1**2)
print('d =',d)
V=Ya-(G2/(G1**2))
print('V =',V)

b=T/gamma(1+1/a)
print('b =',b)